Autodesk.Revit.DB.DirectShape.GetExternallyTaggedGeometry(Autodesk.Revit.DB.ExternalGeometryId)
Gets the externally tagged geometry by its external ID that is stored in this DirectShape.
externalId:
The external ID of the externally tagged geometry that should be obtained.
Returns:
The externally tagged geometry.
Or null if there is no such externally tagged geometry in the DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferenceCurve(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.DirectShapeReferenceOptions)
Adds a reference curve to the DirectShape.
Remarks:
There are two cases to consider:
The input curve's bounds are set. The resulting reference curve that is added to the DirectShape will be displayed with those bounds.
Note that the specified bounds must not be degenerate. Permitted curve types are those for which Autodesk::Revit::DB::DirectShape::isValidReferenceCurve returns true.  The input curve is unbounded. Reasonable bounds are automatically calculated and applied to the input curve.
The automatic bounds are based on the host DirectShape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
refCurve:
The geometry of the new reference curve.
options:
The options that are used to configure the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
-or-
options cannot be used to add a reference object to this DirectShape.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.DirectShape.AddReferenceCurve(Autodesk.Revit.DB.Curve)
Adds a reference curve to the DirectShape.
Remarks:
There are two cases to consider:
The input curve's bounds are set. The resulting reference curve that is added to the DirectShape will be displayed with those bounds.
Note that the specified bounds must not be degenerate. Permitted curve types are those for which Autodesk::Revit::DB::DirectShape::isValidReferenceCurve returns true.  The input curve is unbounded. Reasonable bounds are automatically calculated and applied to the input curve.
The automatic bounds are based on the host DirectShape's geometry.
Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.
refCurve:
The geometry of the new reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentException:
refCurve cannot be used for creating a reference curve.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2022